import 'package:book_app/poem_details_screen.dart';
import 'package:flutter/material.dart';

class BanglaScreen extends StatefulWidget {
  const BanglaScreen({super.key});

  @override
  State<BanglaScreen> createState() => _BanglaScreenState();
}

class _BanglaScreenState extends State<BanglaScreen> {
  List<Map> poems = [
    {
      'title': 'আমার সোনার বাংলা',
      'author': 'রবীন্দ্রনাথ ঠাকুর',
      'lines': '''আমার সোনার বাংলা,
     আমি তোমায় ভালোবাসি। চিরদিন তোমার আকাশ,
      তোমার বাতাস, আমার প্রাণে বাজায় বাঁশি।।
      ও মা, ফাগুনে তোর আমের বনে ঘ্রাণে পাগল করে,
      মরি হায়, হায় রে! ও মা, তোর ভরা ক্ষেতে আমি কী দেখেছি!
      দেখেছি মধুর হাসি।।
      কী দেখেছি! দেখেছি তরুণীর মুখে,
      দেখেছি বালকের খেলা,
        দেখেছি ফুলের মেলা।।
      কী দেখেছি! দেখেছি সোনার তরী,
      দেখেছি হাওয়ার ঝোঁক,
      দেখেছি মেঘের ডানা।।
      কী দেখেছি! দেখেছি তোমার বুকে
        আমি কী দেখেছি! দেখেছি আমার সোনার বাংলা,
        আমি তোমায় ভালোবাসি।।
        চিরদিন তোমার আকাশ, তোমার বাতাস,
         আমার প্রাণে বাজায় বাঁশি।।''',
    },
    {
      'title': 'বিদ্রোহী',
      'author': 'কাজী নজরুল ইসলাম',
      'lines': '''বিজড়িত বীরের শূন্য হাতে
        বাজে না কোন সুর,
        বিজড়িত বীরের শূন্য হাতে
        বাজে না কোন সুর,
        বিজড়িত বীরের শূন্য হাতে
        বাজে না কোন সুর,
        বিজড়িত বীরের শূন্য হাতে
        বাজে না কোন সুর,
        বিজড়িত বীরের শূন্য হাতে
        বাজে না কোন সুর,
        বিজড়িত বীরের শূন্য হাতে
          বাজে না কোন সুর,
          বিজড়িত বীরের শূন্য হাতে
          বাজে না কোন সুর,
          বিজড়িত বীরের শূন্য হাতে
          বাজে না কোন সুর,
            বিজড়িত বীরের শূন্য হাতে
            বাজে না কোন সুর,
            বিজড়িত বীরের শূন্য হাতে
            বাজে না কোন সুর,
            বিজড়িত বীরের শূন্য হাতে
            বাজে না কোন সুর,''',
    },
    {
      'title': 'চল চল চল',
      'author': 'কাজী নজরুল ইসলাম',
      'lines': '''
চল চল চল
ঊর্দ্ধ গগনে বাজে মাদল
নিম্নে উতলা ধরণী তল
অরুণ প্রাতের তরুণ দল
    চলরে চলরে চল।।
ঊষার দুয়ারে হানি আঘাত
আমরা আনিব রাঙা প্রভাত
আমরা টুটিব তিমির রাত
বাঁধার বিন্ধ্যা চল।।
নব নবীনের গাহিয়া গান
সজীব করিব মহাশশ্মান
আমরা দানিব নতুন প্রাণ
    বাহুতে নবীন বল।।
চলরে নওজোয়ান, শোনরে পাতিয়া কান
মৃত্যু তোরণ দুয়ারে দুয়ারে জীবনের আহ্বান
ভাঙ্গরে ভাঙ্গ আগল
    চলরে চলরে চল।।
''',
    },
    {
      'title': 'সোনার তরী',
      'author': 'জসীম উদ্দীন',
      'lines': '''গগনে গরজে মেঘ, ঘন বরষা।

     কূলে একা বসে আছি, নাহি ভরসা।

            রাশি রাশি ভারা ভারা

            ধান কাটা হল সারা,

            ভরা নদী ক্ষুরধারা

                    খরপরশা।

     কাটিতে কাটিতে ধান এল বরষা।

     একখানি ছোটো খেত, আমি একেলা,

     চারি দিকে বাঁকা জল করিছে খেলা।

            পরপারে দেখি আঁকা

            তরুছায়ামসীমাখা

            গ্রামখানি মেঘে ঢাকা

                    প্রভাতবেলা--

     এ পারেতে ছোটো খেত, আমি একেলা।

     গান গেয়ে তরী বেয়ে কে আসে পারে,

     দেখে যেন মনে হয় চিনি উহারে।

            ভরা-পালে চলে যায়,

            কোনো দিকে নাহি চায়,

            ঢেউগুলি নিরুপায়

                    ভাঙে দু-ধারে--

     দেখে যেন মনে হয় চিনি উহারে।

ওগো, তুমি কোথা যাও কোন্‌ বিদেশে,

     বারেক ভিড়াও তরী কূলেতে এসে।

            যেয়ো যেথা যেতে চাও,

            যারে খুশি তারে দাও,

            শুধু তুমি নিয়ে যাও

                    ক্ষণিক হেসে

     আমার সোনার ধান কূলেতে এসে।

     যত চাও তত লও তরণী-'পরে।

     আর আছে?-- আর নাই, দিয়েছি ভরে।

            এতকাল নদীকূলে

            যাহা লয়ে ছিনু ভুলে

            সকলি দিলাম তুলে

                    থরে বিথরে--

     এখন আমারে লহ করুণা করে।

     ঠাঁই নাই, ঠাঁই নাই-- ছোটো সে তরী

     আমারি সোনার ধানে গিয়েছে ভরি।

            শ্রাবণগগন ঘিরে

            ঘন মেঘ ঘুরে ফিরে,

            শূন্য নদীর তীরে

                    রহিনু পড়ি--

     যাহা ছিল নিয়ে গেল সোনার তরী।'''
},
{'title': 'বনলতা সেন',
      'author': 'জীবনানন্দ দাশ',
      'lines': '''
          বনলতা সেন, তুমি কোথা থেকে এলে
          রাতের আকাশে চাঁদের দেশে থেকে?
          আমি পথ হারিয়ে ভ্রান্ত পথিক,
          তোমার পথ ধরে এসেছি দেশে।
          বনলতা সেন, তুমি কোথা থেকে এলে
          রাতের আকাশে চাঁদের দেশে থেকে?
          আমি পথ হারিয়ে ভ্রান্ত পথিক,
          তোমার পথ ধরে এসেছি দেশে।
          বনলতা সেন, তুমি কোথা থেকে এলে
          রাতের আকাশে চাঁদের দেশে থেকে?
          আমি পথ হারিয়ে ভ্রান্ত পথিক,
          তোমার পথ ধরে এসেছি দেশে।
          বনলতা সেন, তুমি কোথা থেকে এলে
          রাতের আকাশে চাঁদের দেশে থেকে?
          আমি পথ হারিয়ে ভ্রান্ত পথিক,
          তোমার পথ ধরে এসেছি দেশে।'''
},
{
'title': 'আমার ভাইয়ের রক্তে রাঙানো',
      'author': 'জয়দেব',
      'lines': '''আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি
          আমি কি ভুলিতে পারি?
          আমি কি ভুলিতে পারি?
          সেই দিনটি আমি ভুলিতে পারি না
          যে দিনটি আমার প্রাণের মণিকোঠায়
          অমর হয়ে থাকবে চিরদিন
          সেই দিনটি আমি ভুলিতে পারি না
          যে দিনটি আমার প্রাণের মণিকোঠায়
          অমর হয়ে থাকবে চিরদিন
          আমার ভাইয়ের রক্তে রাঙানো একুশে ফেব্রুয়ারি
          আমি কি ভুলিতে পারি?
          আমি কি ভুলিতে পারি?''',
},
{
'title': 'হেমন্ত',
      'author': 'রবীন্দ্রনাথ ঠাকুর',
      'lines': '''হেমন্তের প্রথম রোদে
          ভোরের কুয়াশা ঝরিছে,
          পাখির ডাকে ডাকে
          ঘুম ভাঙে মধুর সুরে।
          হেমন্তের প্রথম রোদে
          ভোরের কুয়াশা ঝরিছে,
          পাখির ডাকে ডাকে
          ঘুম ভাঙে মধুর সুরে।
          হেমন্তের প্রথম রোদে
          ভোরের কুয়াশা ঝরিছে,
          পাখির ডাকে ডাকে
          ঘুম ভাঙে মধুর সুরে।''',
},
{
'title': 'চাঁদের হাসি',
      'author': 'সুকান্ত ভট্টাচার্য',
      'lines': '''চাঁদের হাসি যেন
          মেঘের আড়ালে লুকিয়ে থাকে,
          তারই খোঁজে আমি
          রাতের আকাশে তাকিয়ে থাকি।
          চাঁদের হাসি যেন
          মেঘের আড়ালে লুকিয়ে থাকে,
          তারই খোঁজে আমি
          রাতের আকাশে তাকিয়ে থাকি।
          চাঁদের হাসি যেন
          মেঘের আড়ালে লুকিয়ে থাকে,
          তারই খোঁজে আমি
          রাতের আকাশে তাকিয়ে থাকি।''',
},
{
'title': 'বৃষ্টির গান',
      'author': 'আবুল মনসুর',
      'lines': '''বৃষ্টি পড়ে ধীরে ধীরে,
          মাটির গন্ধে ভরে যায় বায়ু।
          পাখিরা ফিরে আসে ঘরে,
          সবুজে মাখা হয় দিগন্ত।
          বৃষ্টি পড়ে ধীরে ধীরে,
          মাটির গন্ধে ভরে যায় বায়ু।
          পাখিরা ফিরে আসে ঘরে,
          সবুজে মাখা হয় দিগন্ত।
          বৃষ্টি পড়ে ধীরে ধীরে,
          মাটির গন্ধে ভরে যায় বায়ু।''',
},
{
'title': 'নদীর গান',
      'author': 'কাজী নজরুল ইসলাম',
      'lines': '''নদী বয়ে চলে চিরদিন,
          তার স্রোতে মিশে যায় জীবন।
          পাখিরা গায় তার গান,
          বয়ে চলে সে নিরন্তর।
          নদী বয়ে চলে চিরদিন,
          তার স্রোতে মিশে যায় জীবন।
          পাখিরা গায় তার গান,
          বয়ে চলে সে নিরন্তর।
          নদী বয়ে চলে চিরদিন,
          তার স্রোতে মিশে যায় জীবন।''',
},
{
'title': 'শিশুর গান',
      'author': 'জসীম উদ্দীন',
      'lines': '''শিশুরা হাসে খেলে,
          তাদের মুখে মধুর হাসি।
          তারা আনে আনন্দ,
          জীবন হয়ে ওঠে রঙিন।
          শিশুরা হাসে খেলে,
          তাদের মুখে মধুর হাসি।
          তারা আনে আনন্দ,
          জীবন হয়ে ওঠে রঙিন।
          শিশুরা হাসে খেলে,
          তাদের মুখে মধুর হাসি।''',
},
{
'title': 'বসন্তের আগমন',
      'author': 'রবীন্দ্রনাথ ঠাকুর',
      'lines': '''বসন্ত এলো ঘরে ঘরে,
          ফুল ফুটে উঠলো বনে বনে।
          পাখিরা গায় তার গান,
          জীবন হয়ে উঠলো রঙিন।
          বসন্ত এলো ঘরে ঘরে,
          ফুল ফুটে উঠলো বনে বনে।
          পাখিরা গায় তার গান,
          জীবন হয়ে উঠলো রঙিন।
          বসন্ত এলো ঘরে ঘরে,
          ফুল ফুটে উঠলো বনে বনে।''',
},
{
'title': 'শান্তি',
      'author': 'সুকান্ত ভট্টাচার্য',
      'lines': '''শান্তি আসে হৃদয়ে,
          যখন মন হয় নির্জন।
          সব কষ্ট ভুলে যায়,
          জীবন হয়ে ওঠে মধুর।
          শান্তি আসে হৃদয়ে,
          যখন মন হয় নির্জন।
          সব কষ্ট ভুলে যায়,
          জীবন হয়ে ওঠে মধুর।
          শান্তি আসে হৃদয়ে,
          যখন মন হয় নির্জন।''',
},
{
'title': 'আলো',
      'author': 'আবুল মনসুর',
      'lines': '''আলো আসে জীবনে,
          অন্ধকার দূর করে।
          পথ দেখায় সঠিক,
          জীবন হয়ে ওঠে সুন্দর।
          আলো আসে জীবনে,
          অন্ধকার দূর করে।
          পথ দেখায় সঠিক,
          জীবন হয়ে ওঠে সুন্দর।
          আলো আসে জীবনে,
          অন্ধকার দূর করে।''',
},
{
'title': 'স্বপ্ন',
      'author': 'কাজী নজরুল ইসলাম',
      'lines': '''স্বপ্ন দেখি নতুন দিনের,
          যেখানে শান্তি বিরাজ করে।
          সবাই মিলে হাসে খেলে,
          জীবন হয়ে ওঠে রঙিন।
          স্বপ্ন দেখি নতুন দিনের,
          যেখানে শান্তি বিরাজ করে।
          সবাই মিলে হাসে খেলে,
          জীবন হয়ে ওঠে রঙিন।
          স্বপ্ন দেখি নতুন দিনের,
          যেখানে শান্তি বিরাজ করে।''',
},
{
'title': 'প্রকৃতি',
      'author': 'জসীম উদ্দীন',
      'lines': '''প্রকৃতি মায়াবী,
          তার রূপে মুগ্ধ হই।
          ফুলের গন্ধে ভরে যায়,
          মন হয়ে ওঠে শান্তি।
          প্রকৃতি মায়াবী,
          তার রূপে মুগ্ধ হই।
          ফুলের গন্ধে ভরে যায়,
          মন হয়ে ওঠে শান্তি।
          প্রকৃতি মায়াবী,
          তার রূপে মুগ্ধ হই।''',
},
  ];

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: 
      ListView.separated(
        itemCount: poems.length,
        separatorBuilder: (context, index) {
          return Divider(color: Colors.blue,
          thickness: 1.0,
          indent:15,
          endIndent:15,
          );
        },
        itemBuilder: (context,index){
          Map Poem = poems[index];
          return ListTile(
                 onTap: () {
                   Navigator.push(
                    context, 
                    MaterialPageRoute(builder: (context)=>PoemDetailsScreen(Poem))
                    );
                 },
            leading: CircleAvatar(
              backgroundColor:Colors.blueAccent[100],
              //child: Icon(Icons.book,color: Colors.white,),
              child: Text((index+1).toString(),style: TextStyle(color: Colors.white,fontWeight: FontWeight.bold),              ),
              ),
              title: Text(Poem['title'],style: TextStyle(fontWeight: FontWeight.bold,fontSize: 18)),
              subtitle: Text('লেখক: ${Poem['author']}',style: TextStyle(fontSize: 16)),
          );
        }
        ));
  }
}
